wireguard.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-08-20 Sat 16:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>wireguard</title>
<meta name="generator" content="Org Mode" />
<meta charset="UTF-8">
<nav>
<a href="index.html">home</a> /
<a href="about.html">about</a> /
<a href="sitemap.html">sitemap</a> /
</nav>
</head>
<body>
<div id="content" class="content">
<h1 class="title">wireguard</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0000000">1. genkey</a></li>
<li><a href="#org0000001">2. config with wg-quick</a>
<ul>
<li><a href="#org0000002">2.1. masquerade</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org0000000" class="outline-2">
<h2 id="org0000000"><span class="section-number-2">1.</span> genkey</h2>
<div class="outline-text-2" id="text-1">
<p>
you can generate a wireguard key with wg genkey and then put it in wg pubkey to get the public key
</p>

<p>
to get both at the same time you can
</p>

<p>
wg genkey | tee /dev/stderr | wg pubkey 2&gt;&amp;1
</p>

<p>
(this makes a key, uses tee to send it to both stderr and wg pubkey, then the optional 2&gt;&amp;1 puts it back into stdout) 
</p>
</div>
</div>

<div id="outline-container-org0000001" class="outline-2">
<h2 id="org0000001"><span class="section-number-2">2.</span> config with wg-quick</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org0000002" class="outline-3">
<h3 id="org0000002"><span class="section-number-3">2.1.</span> masquerade</h3>
<div class="outline-text-3" id="text-2-1">
<p>
wg-quick needs some extra PostUp options for masquerade to work
</p>
<div class="org-src-container">
<pre class="src src-wg-config">[Interface]
PostUp = ip6tables -A FORWARD -i %i -j ACCEPT; ip6tables -t nat -A POSTROUTING -o eth0 -j MASQUERADE; iptables -A FORWARD -i %i -j ACCEPT; iptables -t nat -A POSTROUTING -o eth0 -j MASQUERADE
PostUp = sysctl -w net.ipv6.conf.all.forwarding=1
PostUp = sysctl -w net.ipv4.ip_forward=1
PostDown = iptables -D FORWARD -i %i -j ACCEPT; iptables -t nat -D POSTROUTING -o eth0 -j MASQUERADE; ip6tables -t nat -D POSTROUTING -o eth0 -j MASQUERADE
ListenPort = 51820
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
